<?php
/**
 * クイズ回答数確認API
 * /quiz/api/isend.php
 *
 * @version 1.0.0
 * @author M.katsube <katsubemakito@gmail.com>
 * @copyright 2019 M.katsube
 */

//------------------------------------------------
// ライブラリ
//------------------------------------------------
require_once('util.php');

//------------------------------------------------
// 回答者数を集計
//------------------------------------------------
$list  = getAnswerUser();
$count = count($list);		// 回答人数

//------------------------------------------------
// 結果出力
//------------------------------------------------
putResult(true, [
	  'isend' => ($count === MAX_PLAYER)
	, 'count' => $count
]);
